[
    {
        "_id":"0",
        "name": "Caponata pasta",
        "preptime": "10",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/caponata-pasta-a0027c4.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "2",
        "ingredients": "4 tbsp olive oil 1 large onion, finely chopped 4 garlic cloves, finely sliced 250g chargrilled Mediterranean veg (peppers and aubergines, if possible) from a jar, pot or deli counter, drained if in oil (you can use this oil in place of the olive oil and roughly chopped 400g can chopped tomatoes 1 tbsp small capers 2 tbsp raisins 350g rigatoni, penne or another short pasta shape bunch basil leaves, picked parmesan (or vegetarian alternative), shaved, to serve",
        "instructions": "STEP 1 Heat the oil in a large pan and cook the onion for 8-10 mins until starting to caramelise (or for longer if you have time – the sweeter the better). Add the garlic for the final 2 mins of cooking time. STEP 2 Tip in the mixed veg, tomatoes, capers and raisins. Season well and simmer, uncovered, for 10 mins, or until you have a rich sauce. STEP 3 Meanwhile, boil the kettle. Pour the kettleful of water into a large pan with a little salt and bring back to the boil. Add the pasta and cook until tender with a little bite, then drain, reserving some of the pasta water. Tip the pasta into the sauce, adding a splash of pasta water if it needs loosening. Scatter with the basil leaves and parmesan, if you like, and serve straight from the pan",
        "createdAt": "2022-07-19T14:22:15.446Z",
        "updatedAt": "2022-07-19T14:22:15.446Z"
    },
    {
        "_id":"1",
        "name": "Beef&broccoli noodles",
        "preptime": "10",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-5283_11-4b1fcc7.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "2",
        "ingredients": "3 blocks egg noodles 1 head broccoli , cut into small florets 1 tbsp sesame oil 400g pack beef stir-fry strips sliced spring onion For the sauce 3 tbsp low-salt soy sauce 2 tbsp oyster sauce (not oyster stir-fry sauce) 1 tbsp tomato ketchup 2 garlic cloves , crushed 1 thumb-sized knob ginger , peeled and finely grated 1 tbsp white wine vinegar",
        "instructions": "STEP 1 Start by making up the sauce. Mix the ingredients together in a small bowl. Boil the noodles according to pack instructions. A minute before they are ready, tip in broccoli. STEP 2 Meanwhile, heat the oil in a wok until very hot, then stir-fry the beef for 2-3 mins until well browned. Tip in the sauce, give it a stir, let it simmer for a moment, then turn off the heat. Drain the noodles, stir into the beef and serve straight away, scattered with spring onions.",
        "createdAt": "2022-07-19T14:27:11.427Z",
        "updatedAt": "2022-07-19T14:27:11.427Z"
    },
    {
        "_id":"2",
        "name": "Sweetcorn cakes",
        "preptime": "10",
        "time": "20",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1287479_8-85ec485.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "3",
        "ingredients": "400g can mixed bean in water, drained 400g can chickpea , drained 50g mature cheddar , grated 198g can sweetcorn , drained 8 jalapeno chilli slices from a jar, finely chopped 1 egg , beaten small handful coriander , chopped 2 tbsp vegetable oil 10 cherry tomatoes , quartered ½ red onion , sliced juice ½ lime mixed salad leaves , to serve (optional)",
        "instructions": "STEP 1 Put the beans and chickpeas in the bowl of a food processor and blend until smooth. Tip into a bowl and add the cheese, sweetcorn, jalapeños, egg and half the coriander. Season, mix well to combine, then shape into 8 patties.STEP 2 Heat the oil in a large frying pan and cook the patties for 4 mins on each side – you may have to do this in batches. Keep them warm in the oven as you go. STEP 3 Mix the tomatoes, onion, remaining coriander and lime juice with a little salt. Serve the cakes with salsa and salad leaves, if you like.",
        "createdAt": "2022-07-19T14:29:42.278Z",
        "updatedAt": "2022-07-19T14:29:42.278Z"
    },
    {
        "_id":"3",
        "name": "Gnocchi",
        "preptime": "10",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/gnocchi-with-mushrooms-ef4cba5.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "2",
        "ingredients": "2 x 400g packs fresh gnocchi 1 tbsp olive oil knob of butter 1 large onion, roughly chopped 500g small Forestière or Portobello mushrooms, sliced 2 large garlic cloves, chopped 150g pack creamy blue cheese small pack parsley, chopped",
        "instructions": "STEP 1 Bring a large pan of water to the boil and cook the gnocchi following pack instructions. When they float to the top of the pan, they are ready. Drain and set aside. STEP 2 Meanwhile, heat the oil and butter in a large lidded frying pan. Add the onion and mushrooms, cook for 1 min over a high heat, then turn down the heat to medium, put the lid on and cook for 5 mins, stirring a few times. STEP 3Remove the lid and add the garlic, cook for 1-2 mins, then stir the gnocchi into the pan. Scatter over blobs of cheese and the parsley.",
        "createdAt": "2022-07-19T14:31:51.437Z",
        "updatedAt": "2022-07-19T14:31:51.437Z"
    },
    {
        "_id":"4",
        "name": "Vegan fajitas",
        "preptime": "5",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/vegan-fajitas-ad1ecfa.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "4",
        "ingredients": "1 tbsp vegetable oil 2 red or yellow peppers , cut into strips 1 red onion , sliced 1 garlic clove , crushed ½ tsp chilli powder or chilli flakes ½ tsp smoked paprika ½ tsp ground cumin 1 lime , juiced 400g can black beans , rinsed and drained small bunch coriander , finely chopped 4 large or 8-12 small tortillas 1 avocado , sliced dairy free yogurt , to serve (optional)",
        "instructions": "STEP 1 Heat the oil in a frying pan and fry the peppers and onions over a medium high heat until tender and starting to turn golden brown, about 6-8 mins. Add the garlic and spices and fry for 1 min more until fragrant. Add half of the lime juice and season. Transfer to a serving dish and keep warm while you heat the beans. STEP 2 Tip the black beans into the same frying pan and add the remaining lime juice. Season well, and stir until warmed through and coated in any remaining spices from the pan. Stir in most of the coriander. STEP 3 Warm the tortillas in the microwave or wrapped in foil in a low oven, then cover with a tea towel to keep them warm. Serve the wraps with the peppers, beans, avocado, dairy-free yogurt, extra coriander and extra lime wedges to squeeze over, if you like.",
        "createdAt": "2022-07-19T14:34:19.687Z",
        "updatedAt": "2022-07-19T14:34:19.687Z"
    },
    {
        "_id":"5",
        "name": "Onion&feta pizza",
        "preptime": "15",
        "time": "30",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1075534_11-d3f1737.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "4",
        "ingredients": "3 large onions (about 750g/1lb 10oz total weight) 2 garlic cloves 25g butter 2 tbsp olive oil , plus extra for drizzling 2 tsp caster sugar 200g feta cheese 2 big sprigs rosemary , needles stripped from stalks 2 pizza bases",
        "instructions": "STEP 1 Peel, then slice the onions into thin wedges. Thinly slice the garlic. Heat the butter and oil in a large wok or frying pan, tip in the onions and garlic and cook over a medium-high heat for 15 minutes, stirring every now and then until golden. Stir in the sugar and cook a minute or two longer. Season with salt and pepper. Preheat the oven to fan 200C/conventional 220C/gas 7. STEP 2 Put the pizza bases on two oiled baking sheets. Spoon the onion mixture over the pizza bases. Now crumble over the feta and scatter with rosemary. Grind over some black pepper and drizzle with a little oil. Bake for 10 minutes and serve with a green salad.",
        "createdAt": "2022-07-19T14:36:14.872Z",
        "updatedAt": "2022-07-19T14:36:14.872Z"
    },
    {
        "_id":"6",
        "name": "Avocado&black bean",
        "preptime": "5",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/avocado_blackbean_eggs-9b605bb.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "4",
        "ingredients": "2 tsp rapeseed oil 1 red chilli, deseeded and thinly sliced 1 large garlic clove, sliced 2 large eggs 400g can black beans ½ x 400g can cherry tomatoes ¼ tsp cumin seeds 1 small avocado, halved and sliced handful fresh, chopped coriander 1 lime, cut into wedges",
        "instructions": "STEP 1 Heat the oil in a large non-stick frying pan. Add the chilli and garlic and cook until softened and starting to colour. Break in the eggs on either side of the pan. Once they start to set, spoon the beans (with their juice) and the tomatoes around the pan and sprinkle over the cumin seeds. You’re aiming to warm the beans and tomatoes rather than cook them. STEP 2 Remove the pan from the heat and scatter over the avocado and coriander. Squeeze over half of the lime wedges. Serve with the remaining wedges on the side for squeezing over.",
        "createdAt": "2022-07-19T14:38:19.316Z",
        "updatedAt": "2022-07-19T14:38:19.316Z"
    },
    {
        "_id":"7",
        "name": "Carrot&lentil soup",
        "preptime": "5",
        "time": "20",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1074500_11-ee0d41a.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "3",
        "ingredients": "2 tsp cumin seeds pinch chilli flakes 2 tbsp olive oil 600g carrots, washed and coarsely grated (no need to peel) 140g split red lentils 1l hot vegetable stock (from a cube is fine) 125ml milk (to make it dairy-free, see 'try' below) plain yogurt and naan bread, to serve",
        "instructions": "STEP 1 Heat a large saucepan and dry-fry 2 tsp cumin seeds and a pinch of chilli flakes for 1 min, or until they start to jump around the pan and release their aromas. STEP 2 Scoop out about half with a spoon and set aside. Add 2 tbsp olive oil, 600g coarsely grated carrots, 140g split red lentils, 1l hot vegetable stock and 125ml milk to the pan and bring to the boil. STEP 3 Simmer for 15 mins until the lentils have swollen and softened. STEP 4 Whizz the soup with a stick blender or in a food processor until smooth (or leave it chunky if you prefer). STEP 5 Season to taste and finish with a dollop of plain yogurt and a sprinkling of the reserved toasted spices. Serve with warmed naan breads.",
        "createdAt": "2022-07-19T14:40:50.049Z",
        "updatedAt": "2022-07-19T14:40:50.049Z"
    },
    {
        "_id":"8",
        "name": "Enchilada pie",
        "preptime": "5",
        "time": "20",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/enchilada-pie-2fe39cf.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "6",
        "ingredients": "1 tbsp vegetable oil or rapeseed oil 2 peppers, any colour you like, sliced 1 red onion, halved and sliced 400g can mixed beans, drained2 tsp - 2 tbsp fajita spice mix (depending on how spicy you like it) 400g can chopped tomatoes small bunch coriander, chopped 4 corn tortillas 100g low-fat soured cream 30g grated cheddar",
        "instructions": "STEP 1 Heat the oil in a pan. Fry the peppers and onion until soft, about 10 mins. Add the beans, fajita spice mix, chopped tomatoes and some seasoning. Bubble for 5 mins to reduce the tomatoes a little, then stir in most of the coriander. Heat the grill and warm the tortillas in the microwave for 30 seconds. STEP 2 Spread a quarter of the pepper and onion mixture over the base of an ovenproof dish (a round one, if possible) or frying pan. Top with some of the soured cream and a warm tortilla, then repeat the layers three more times, finishing off with a final layer of soured cream. Sprinkle over the cheese and grill for 5 mins, or until golden and bubbling. Scatter with the remaining coriander before serving.",
        "createdAt": "2022-07-19T14:43:05.911Z",
        "updatedAt": "2022-07-19T14:43:05.911Z"
    },
    {
        "_id":"9",
        "name": "Tomato gazpacho",
        "preptime": "5",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2021/08/Smoky-tomato-gazpacho-db28003.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "5",
        "ingredients": "2 slices wholemeal bread ½ tbsp olive oil 1 tsp dried oregano 2 garlic cloves ½ small bunch of basil 200g roasted red peppers from a jar 800g tomatoes, roughly chopped 1 tsp caster sugar 1 tsp white wine or apple cider vinegar (check the label if vegan) 1 tbsp chipotle paste",
        "instructions": "STEP 1 Blitz the bread in a small food processor until you have large breadcrumbs. Drizzle the olive oil into a frying pan over a high heat, add the breadcrumbs along with the oregano and fry for 4-5 mins until golden brown. Transfer to a plate and set aside to cool. STEP 2 Meanwhile put 300ml water, the garlic, most of the basil, red peppers, tomatoes, sugar, vinegar and chipotle paste in a jug blender. Blitz on a low speed and slowly increase the speed to maximum until you have a smooth gazpacho. Season and chill until ready to serve.STEP 3 Ladle into bowls, sprinkle over the breadcrumbs and scatter over the reserved basil leaves to serve.",
        "createdAt": "2022-07-19T14:45:22.885Z",
        "updatedAt": "2022-07-19T14:45:22.885Z"
    },
    {
        "_id":"10",
        "name": "Quick flatbreads",
        "preptime": "5",
        "time": "25",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Quick-and-fluffy-flatbread-d4136f8.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "8",
        "ingredients": "300g self-raising flour, plus extra for dusting ½ tsp baking powder 150g natural yogurt 1 tbsp vegetable oil melted ghee or butter, for brushing cumin seeds, chopped garlic cloves, chopped coriander or chopped chillies (optional)",
        "instructions": "STEP 1 Combine the flour, baking powder, yogurt and oil with 1 tsp salt and 2 tbsp water, and bring together into a rough dough. Tip onto a lightly floured surface and knead for a few minutes until slightly smooth, then divide into four to eight pieces, depending on the size of flatbread you want. STEP 2 Heat a heavy-based frying pan over a high heat. To make basic flatbreads, roll the dough pieces out on a lightly floured surface into rough ovals, then fry for 1-2 mins on each side until golden and slightly charred in spots. Alternatively, roll the dough pieces out, brush with a little melted ghee or butter, and scatter over the cumin seeds, garlic, coriander or chillies, if you like. Fold each piece of dough over on itself, then roll out again into a rough oval and cook in the same way. STEP 3 Brush the flatbreads with a little melted butter or ghee, then serve.",
        "createdAt": "2022-07-19T14:47:34.054Z",
        "updatedAt": "2022-07-19T14:47:34.054Z"
    },
    {
        "_id":"11",
        "name": "Vegetarian ramen",
        "preptime": "5",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/super-quick-sesame-ramen-e1d0772.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "4",
        "ingredients": "80g pack instant noodles (look for an Asian brand with a flavour like sesame) 2 spring onions , finely chopped ½ head pak choi 1 egg1 tsp sesame seeds chilli sauce , to serve",
        "instructions": "STEP 1 Cook the noodles with the sachet of flavouring provided (or use stock instead of the sachet, if you have it). Add the spring onions and pak choi for the final min. STEP 2 Meanwhile, simmer the egg for 6 mins from boiling, run it under cold water to stop it cooking, then peel it. Toast the sesame seeds in a frying pan. STEP 3 Tip the noodles and greens into a deep bowl, halve the boiled egg and place on top. Sprinkle with sesame seeds, then drizzle with the sauce or sesame oil provided with the noodles, and chilli sauce, if using.",
        "createdAt": "2022-07-19T14:49:27.089Z",
        "updatedAt": "2022-07-19T14:49:27.089Z"
    },
    {
        "_id":"12",
        "name": "Tahini, feta & honey toastie",
        "preptime": "5",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/tahini-feta-and-honey-toastie-c0e1a26.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "4",
        "ingredients": "1 tbsp tahini,2 tsp honey 2 slices of bread , sourdough works well for toasting 50g feta a few thyme leaves butter 1 tsp sesame seeds a drizzle of honey",
        "instructions": "STEP 1 Mix the tahini and honey together. Spread the mixture on a slice of bread (sourdough works well for toasting). Scatter over the feta and a few thyme leaves, then top with another slice of bread. Butter the outsides and press sesame seeds into each side. Fry in a hot pan, weighed down by another pan, for 2 mins on each side (or use a toasted sandwich maker), then drizzle with honey.",
        "createdAt": "2022-07-19T14:45:22.885Z",
        "updatedAt": "2022-07-19T14:45:22.885Z"
    },
    {
        "_id":"13",
        "name": "Tricolore couscous salad",
        "preptime": "5",
        "time": "15",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-7717_11-c0eadec.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "2",
        "ingredients": "200g couscous 2 tsp vegetable stock (or use a cube) 250g pack cherry tomato , halved 2 avocados , peeled, stoned and chopped 150g pack mozzarella , drained and chopped handful rocket or young spinach leaves For the dressing1 rounded tbsp pesto1 tbsp lemon juice3 tbsp olive oil",
        "instructions": "STEP 1 Mix the couscous and stock in a bowl, pour over 300ml boiling water, then cover with a plate and leave for 5 mins.STEP 2 For the dressing, mix the pesto with the lemon juice and some seasoning, then gradually mix in the oil. Pour over the couscous and mix with a fork. STEP 3 Mix the tomatoes, avocado and mozzarella into the couscous, then lightly stir in the rocket or spinach to serve.",
        "createdAt": "2022-07-19T14:47:34.054Z",
        "updatedAt": "2022-07-19T14:47:34.054Z"
    },
    {
        "_id":"14",
        "name": "Halloumi with tomatoes",
        "preptime": "3",
        "time": "10",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/halloumi-with-tomatoes-pomegranate-molasses_0-2255eb6.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "2",
        "ingredients": "1-2 tbsp olive oil ½ tsp za’atar 225g pack halloumi , sliced 5 cherry tomatoes , halved 1 tbsp pomegranate molasses handful mint leaves , to serve 1-2 tsp pomegranate seeds , to serve",
        "instructions": "STEP 1 Pour the olive oil into a medium bowl, add the za’atar and stir to combine. Add the halloumi and toss in the mixture until well coated. STEP 2 Heat a large griddle pan. Place the halloumi in the pan and cook for 1-2 mins, then turn over and cook for a further 1-2 mins until golden brown on both sides. After turning the halloumi, add the cherry tomatoes and move them around the pan quickly so they cook all over. STEP 3 Transfer the halloumi and tomatoes to a plate, then drizzle over the pomegranate molasses and serve with the mint leaves and pomegranate seeds scattered over.",
        "createdAt": "2022-07-19T14:49:27.089Z",
        "updatedAt": "2022-07-19T14:49:27.089Z"
    },
    {
        "_id":"15",
        "name": "Polenta with cauliflower",
        "preptime": "10",
        "time": "35",
        "imageUrl": "https://images.immediate.co.uk/production/volatile/sites/30/2021/12/Lemony-polenta-with-roasted-cauliflower-pine-nuts-raisins-and-capers-70f8691.jpg?resize=960,872?quality=90&webp=true&resize=375,341",
        "servings": "4",
        "ingredients": "1 medium cauliflower, cut into small florets 2 garlic cloves, grated 2 tbsp olive oil 50g pine nuts 2 tsp capers, roughly chopped For the dressing 10g flat-leaf parsley, finely chopped 1 lemon, juiced (save the zest for the polenta) 30ml extra virgin olive oil 80g raisins For the lemony polenta 800ml vegetable stock 150g polenta 200g ricotta 1 lemon, zested 10g flat-leaf parsley, roughly chopped",
        "instructions": "STEP 1 Heat the oven to 220C/200C fan/gas 7. Tip the cauliflower, garlic and oil into a large roasting tin, mix well, then transfer to the oven to roast for 25 mins, tossing halfway through with some seasoning. STEP 2 Meanwhile, make the dressing by whisking together the parsley, lemon juice, oil and 1 tsp salt in a small bowl, add the raisins and set aside. Add the pine nuts and capers to the cauliflower to toast for the final 5 mins of cooking time. STEP 3 Once the cauliflower is cooked, stir through the dressing. Set aside STEP 4 For the lemony polenta, bring the stock up to the boil in a large saucepan, add the polenta and stir for 4 mins until thickened. Add the ricotta and lemon zest and a little of the parsley, then taste and adjust the salt as needed. STEP 5 Divide the lemony polenta between four warmed bowls, then top with the dressed cauliflower. Scatter over the remaining parsley, and serve straightaway.",
        "createdAt": "2022-07-19T14:45:22.885Z",
        "updatedAt": "2022-07-19T14:45:22.885Z"
    }
    
 
]